RIET/src/DataProcessors/rgsМониторСопровождения_old/rgsМониторСопровождения_old.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>rgsМониторСопровождения_old</name>
  <comment>Обработка подключения к Монитору сопровождения, версия 2.0.1.1 (8.2)</comment>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Пароль</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресБазы</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗагружатьЗакрытыеОтмененныеВопросы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяОбновления</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбновлятьАвтоматически</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ГУИДТекПользователя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяТекПользователя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтображатьТекстВопросаСЗадержкой</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяОбновленияТекстаВопроса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТолькоМои</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказатьПолностью</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтображатьКонтакты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьПомощник</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерВерсии</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокПроектовИПользователей</name>
    <attributes>
      <name>НаименованиеПроекта</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ГУИДПроекта</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>40</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Описание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>300</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ГУИДПользователя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>40</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИмяПользователя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СторонаПользователя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЯвляетсяСотрудникомПоддержки</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДобавлятьПоУмолчанию</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СрокОтвета</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РасшифровкаЗадач</name>
    <attributes>
      <name>ГУИДЗадачи</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>40</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидЗадачи</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ГУИДВидаЗадачи</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>40</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДопРеквизит1</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДопРеквизит1ГУИД</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>40</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДопРеквизит2</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДопРеквизит2ГУИД</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>40</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДопРеквизит3</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДопРеквизит3ГУИД</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>40</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДопРеквизит4</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДопРеквизит4ГУИД</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>40</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДопРеквизит5</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДопРеквизит5ГУИД</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>40</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДопРеквизит6</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДопРеквизит6ГУИД</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>40</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДопРеквизит7</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДопРеквизит7ГУИД</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>40</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДопРеквизит8</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДопРеквизит8ГУИД</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>40</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДопРеквизит9</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДопРеквизит9ГУИД</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>40</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДопРеквизит10</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДопРеквизит10ГУИД</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>40</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

RIET/src/DataProcessors/rgsМониторСопровождения_old/Forms/ФормаДобавленияСообщения/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

&НаСервере
// Процедура запускает сервисные функции необходимые для создания вопроса
//
Функция ОтправитьСообщениеНаСервере(КодВопроса, СообщениеХТМЛ, СообщениеТекст)
	
	Попытка
		Определение = Новый WSОпределения( Объект.АдресБазы+"/ws/MonitorExt.1cws?wsdl",  Объект.Пользователь,  Объект.Пароль);
		Прокси = ПолучитьПрокси(Определение);
		Прокси.Пользователь =  Объект.Пользователь;
		Прокси.Пароль = Объект.Пароль; 
		Возврат Прокси.ДобавитьСообщениеВВопрос(ГУИДВопроса, СообщениеХТМЛ, СообщениеТекст, Ложь);
	Исключение
		Возврат ОписаниеОшибки();
	КонецПопытки; 
	
КонецФункции

&НаСервере
// Процедура получает данные для текста вопроса
//
Функция ПолучитьТекстОбсужденияВопроса()
	
	Попытка
		Определение = Новый WSОпределения( Объект.АдресБазы+"/ws/MonitorExt.1cws?wsdl",  Объект.Пользователь,  Объект.Пароль);
		Прокси = ПолучитьПрокси(Определение);
		Прокси.Пользователь = Объект.Пользователь;
		Прокси.Пароль = Объект.Пароль; 
		ПараметрВхода = Новый Структура;
		ПараметрВхода.Вставить("ГУИДВопроса", ГУИДВопроса);
		ПараметрВхода.Вставить("ПоказатьПолностью", Истина);
		ТекстВопросаИзБазы = Прокси.ТекстВопроса(ЗначениеВСтрокуВнутр(ПараметрВхода), ПравоЗакрытияТекВопроса);
	Исключение
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = ОписаниеОшибки();
		Сообщение.Сообщить();
		Возврат "";
	КонецПопытки; 

	Возврат ТекстВопросаИзБазы;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьСпискиУчастниковВопроса()
	
	Попытка
		Определение = Новый WSОпределения( Объект.АдресБазы+"/ws/MonitorExt.1cws?wsdl",  Объект.Пользователь,  Объект.Пароль);
		Прокси = ПолучитьПрокси(Определение);
		Прокси.Пользователь =  Объект.Пользователь;
		Прокси.Пароль = Объект.Пароль; 
		ТаблицаУчастниковОбсуждения = ЗначениеИзСтрокиВнутр(Прокси.ПолучитьТаблицуУчастниковОбсужденияВопроса(ГУИДВопроса));
	Исключение
		Сообщить(ОписаниеОшибки()); 
		Возврат;
	КонецПопытки; 
	
	ОтКого.Очистить();
	Кому.Очистить();
	СторонниеНаблюдатели.Очистить();
	Для Каждого СтрокаТЗ Из ТаблицаУчастниковОбсуждения Цикл
		Если СтрокаТЗ.СторонаПользователя = "Спрашивающий" Тогда
			ОтКого.Добавить(СтрокаТЗ.ИмяПользователя);
		КонецЕсли;
		Если СтрокаТЗ.СторонаПользователя = "Отвечающий" Тогда
			Кому.Добавить(СтрокаТЗ.ИмяПользователя);
		КонецЕсли; 
		Если СтрокаТЗ.СторонаПользователя = "Сторонний наблюдатель" Тогда
			СторонниеНаблюдатели.Добавить(СтрокаТЗ.ИмяПользователя);
		КонецЕсли;
	КонецЦикла; 
	
	Если СторонниеНаблюдатели.Количество() = 0  Тогда
		Элементы.СторонниеНаблюдатели.Видимость = Ложь;
	Иначе
		Элементы.СторонниеНаблюдатели.Видимость = Истина;
	КонецЕсли; 
	
	// ищем текущего пользователя в обсуждающих
	Массив = ТаблицаУчастниковОбсуждения.НайтиСтроки(Новый Структура("ГУИДПользователя", ГУИДТекПользователя));
	Если Массив.Количество()=0 Тогда
		Элементы.ГруппаНовогоСообщения.Видимость = Ложь;
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьТаблицуФайлов()
	
	Попытка
		Определение = Новый WSОпределения( Объект.АдресБазы+"/ws/MonitorExt.1cws?wsdl",  Объект.Пользователь,  Объект.Пароль);
		Прокси = ПолучитьПрокси(Определение);
		Прокси.Пользователь =  Объект.Пользователь;
		Прокси.Пароль = Объект.Пароль; 
		ТаблицаПрисоединенныеФайлы.Загрузить(ЗначениеИзСтрокиВнутр(Прокси.ПолучитьТаблицуПрисоединенныхФайлов(ГУИДВопроса)));
		//Элементы.ТолькоДляСотрудниковТП.Видимость = Прокси.ПолучитьВидимостьТП(ГУИДВопроса);
		ГУИДПроекта = Прокси.ПолучитьГУИДПроекта(ГУИДВопроса);
		ВидимостьРедактирует = Ложь;
		Для Каждого СтрокаТЗ Из ТаблицаПрисоединенныеФайлы Цикл
			Если СтрокаТЗ.Редактирует <> "" Тогда
				ВидимостьРедактирует = Истина;
				Прервать;
			КонецЕсли; 
		КонецЦикла; 
		//Элементы.ТаблицаПрисоединенныеФайлыРедактирует.Видимость = ВидимостьРедактирует;
	Исключение
		Сообщить(ОписаниеОшибки());
	КонецПопытки; 
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьBASE64ПредставлениеКартинки(Картинка)
	
	Возврат Base64Строка(Картинка.ПолучитьДвоичныеДанные());
	
КонецФункции

&НаКлиенте
// Подставляет параметры в строку. Максимально возможное число параметров - 9.
// Параметры в строке задаются как %<номер параметра>. Нумерация параметров
// начинается с единицы.
//
// Параметры
//  СтрокаПодстановки  – Строка – шаблон строки с параметрами (вхождениями вида "%ИмяПараметра").
// Параметр<n>         - Строка - параметр
// Возвращаемое значение:
//   Строка   – текстовая строка с подставленными параметрами
//
// Пример:
// Строка = ПодставитьПараметрыВСтроку(ВернутьСтр("ru='%1 пошел в %2'"), "Вася", "Зоопарк");
//
Функция ПодставитьПараметрыВСтроку(Знач СтрокаПодстановки,
	Знач Параметр1,	Знач Параметр2 = Неопределено, Знач Параметр3 = Неопределено,
	Знач Параметр4 = Неопределено, Знач Параметр5 = Неопределено, Знач Параметр6 = Неопределено,
	Знач Параметр7 = Неопределено, Знач Параметр8 = Неопределено, Знач Параметр9 = Неопределено) Экспорт
	
	Если СтрокаПодстановки = Неопределено ИЛИ СтрДлина(СтрокаПодстановки) = 0 Тогда
		Возврат "";
	КонецЕсли;
	
	Результат = "";
	НачПозиция = 1;
	Позиция = 1;
	Пока Позиция <= СтрДлина(СтрокаПодстановки) Цикл
		СимволСтроки = Сред(СтрокаПодстановки, Позиция, 1);
		Если СимволСтроки <> "%" Тогда
			Позиция = Позиция + 1;
			Продолжить;
		КонецЕсли;
		Результат = Результат + Сред(СтрокаПодстановки, НачПозиция, Позиция - НачПозиция);
		Позиция = Позиция + 1;
		СимволСтроки = Сред(СтрокаПодстановки, Позиция, 1);
		
		Если СимволСтроки = "%" Тогда
			Позиция = Позиция + 1;
			НачПозиция = Позиция;
			Продолжить;
		КонецЕсли;
		
		Попытка
			НомерПараметра = Число(СимволСтроки);
		Исключение
			ВызватьИсключение ВернутьСтр("ru='Входная строка СтрокаПодстановки имеет неверный формат: %'" + СимволСтроки);
		КонецПопытки;
		
		Если СимволСтроки = "1" Тогда
			ЗначениеПараметра = Параметр1;
		ИначеЕсли СимволСтроки = "2" Тогда
			ЗначениеПараметра = Параметр2;
		ИначеЕсли СимволСтроки = "3" Тогда
			ЗначениеПараметра = Параметр3;
		ИначеЕсли СимволСтроки = "4" Тогда
			ЗначениеПараметра = Параметр4;
		ИначеЕсли СимволСтроки = "5" Тогда
			ЗначениеПараметра = Параметр5;
		ИначеЕсли СимволСтроки = "6" Тогда
			ЗначениеПараметра = Параметр6;
		ИначеЕсли СимволСтроки = "7" Тогда
			ЗначениеПараметра = Параметр7;
		ИначеЕсли СимволСтроки = "8" Тогда
			ЗначениеПараметра = Параметр8;
		ИначеЕсли СимволСтроки = "9" Тогда
			ЗначениеПараметра = Параметр9;
		Иначе
			ВызватьИсключение ВернутьСтр("ru='Входная строка СтрокаПодстановки имеет неверный формат: %'" + ЗначениеПараметра);
		КонецЕсли;
		Если ЗначениеПараметра = Неопределено Тогда
			ЗначениеПараметра = "";
		Иначе
			ЗначениеПараметра = Строка(ЗначениеПараметра);
		КонецЕсли;
		Результат = Результат + ЗначениеПараметра;
		Позиция = Позиция + 1;
		НачПозиция = Позиция;
	
	КонецЦикла;
	
	Если (НачПозиция <= СтрДлина(СтрокаПодстановки)) Тогда
		Результат = Результат + Сред(СтрокаПодстановки, НачПозиция, СтрДлина(СтрокаПодстановки) - НачПозиция + 1);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
// Процедура - обработчик события "ПриСозданииНаСервере" формы
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Объект.Пользователь = Параметры.Пользователь;
	Объект.Пароль		= Параметры.Пароль;
	Объект.АдресБазы 	= Параметры.АдресБазы;
    КодВопроса			= Параметры.КодВопроса;
	ДатаВопроса			= Параметры.ДатаВопроса;
	Проект				= Параметры.Проект;
	ИсторияОбсуждения	= Параметры.ТекстФорума;
	ЭтаФорма.Заголовок	= Параметры.ТемаВопроса;
	ГУИДТекПользователя = Параметры.ГУИДТекПользователя;
	ГУИДВопроса			= Параметры.ГУИДВопроса;
	АвторВопроса		= Параметры.АвторВопроса;
	Приоритет			= Параметры.Приоритет;
	ТребуемаяДатаОтвета = Параметры.ТребуемаяДатаОтвета;
	НеПрочитан			= Параметры.НеПрочитан;
		
	Элементы.ЗавершитьОбсуждение.Видимость = Параметры.ПравоЗакрытияТекВопроса;
	ЗаполнитьСпискиУчастниковВопроса();
	//Элементы.ГруппаПрисоединенныеФайлы.Видимость = Ложь;
	
	НадписьСтатусаВопроса = Параметры.НадписьСтатусаВопроса;
	КартинкаСтатусаВопроса = Параметры.КартинкаСтатусаВопроса;
	
	// присоединенные файлы
	ОбновитьТаблицуФайлов();
	Если Параметры.ВозможноДобавлениеСообщений = 3 Тогда
		Элементы.ГруппаНовогоСообщения.Видимость = Ложь;                                     		
	КонецЕсли; 
	
	Если НадписьСтатусаВопроса = "Закрыт" или НадписьСтатусаВопроса = "Отменен" Тогда
		Элементы.ЗавершитьОбсуждение.Видимость = Ложь;
	КонецЕсли;
  
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ КОМАНД

&НаКлиенте
// Процедура запускает сервисные функции необходимые для создания вопроса
//
Процедура ДобавитьСообщение(Команда)
	
	СообщениеТекст = ТекстНовогоСообщения.ПолучитьТекст();
	СообщениеХТМЛ = "";
	СтруктураКартинок = Новый Структура;
	ТекстНовогоСообщения.ПолучитьHTML(СообщениеХТМЛ, СтруктураКартинок);
	Для Каждого ЭлСтруктуры Из СтруктураКартинок Цикл
		BASE64 = ПолучитьBASE64ПредставлениеКартинки(ЭлСтруктуры.Значение);
		СообщениеХТМЛ = СтрЗаменить(СообщениеХТМЛ, ЭлСтруктуры.Ключ, "data:image;base64,"+BASE64+"");  
	КонецЦикла;
	
	// пустые сообщения не добавляем
	СообщениеДляПроверки = СтрЗаменить(СообщениеТекст, Символы.ПС, "");
	Если СообщениеДляПроверки = "" Тогда
		Возврат;
	КонецЕсли;
	
	Результат = ОтправитьСообщениеНаСервере(КодВопроса, СообщениеХТМЛ, СообщениеТекст);
	Если ТипЗнч(Результат) <> Тип("Булево") Тогда
		Структура = Новый Структура;
		Структура.Вставить("ТекстПредупреждения",Результат);
		Попытка
			ОткрытьФорму("ВнешняяОбработка.rgsМониторСопровождения.Форма.ФормаПредупреждения", Структура, ЭтаФорма);
		Исключение
			ОткрытьФорму("Обработка.rgsМониторСопровождения.Форма.ФормаПредупреждения", Структура, ЭтаФорма);
		КонецПопытки; 
		Возврат;
	ИначеЕсли Результат Тогда 
		ПоказатьОповещениеПользователя(,,  Символы.ПС + "Сообщение успешно добавлено");
		Оповестить("НужноОбновитьСписокВопросов", , ЭтаФорма);
	КонецЕсли; 
	
	ТекстНовогоСообщения.Удалить();
	ИсторияОбсуждения = ПолучитьТекстОбсужденияВопроса();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьОбсуждение(Команда)
	
	ТекстВопроса = "После выполнения данной операции, добавление новых сообщений в вопрос будет невозможно! Продолжить?";
	Структура = Новый Структура;
	Структура.Вставить("ТекстВопроса",ТекстВопроса);
	Структура.Вставить("РежимВопроса","ОкОтмена");
	Структура.Вставить("ГУИДВопроса", ГУИДВопроса);
	Структура.Вставить("ИмяСобытия","ЗавершениеВопросаИзДобавленияСообщения");
	
	Попытка
		ОткрытьФорму("ВнешняяОбработка.rgsМониторСопровождения.Форма.ФормаВопроса", Структура, ЭтаФорма);
	Исключение
		ОткрытьФорму("Обработка.rgsМониторСопровождения.Форма.ФормаВопроса", Структура, ЭтаФорма);
	КонецПопытки; 

КонецПроцедуры

&НаСервере
// Функция возвращает результат закрытия вопроса
//
Функция ЗавершитьОбсуждениеВопросаСервер(ГУИДВопроса)
	
	ОбъектБаза = РеквизитФормыВЗначение("Объект");
	
	Результат = ОбъектБаза.ЗавершитьОбсуждениеВопросаСервер(ГУИДВопроса);
	
	Возврат Результат;
	
КонецФункции	


&НаКлиенте
Процедура КонтактнаяИнформация(Команда)
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ГУИДВопроса",	ГУИДВопроса);
	СтруктураПараметров.Вставить("Объект",		Объект);
	
   	Попытка
		ОткрытьФорму("ВнешняяОбработка.rgsМониторСопровождения.Форма.ФормаКИ", СтруктураПараметров);
	Исключение
		ОткрытьФорму("Обработка.rgsМониторСопровождения.Форма.ФормаКИ", СтруктураПараметров);
	КонецПопытки; 

КонецПроцедуры

&НаКлиенте
Процедура ПроверитьОрфографию(Команда)
	
	ТекстДляПроверки = ТекстНовогоСообщения.ПолучитьТекст();
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ТекстДляПроверки", ТекстДляПроверки);
	СтруктураПараметров.Вставить("ИмяСобытия", "ПроверкаОрфографииФормаДобавленияСообщения");
	
	ТекстХТМЛ = Неопределено;
	Попытка
		ОткрытьФорму("ВнешняяОбработка.rgsМониторСопровождения.Форма.ФормаПроверкиОрфографии", СтруктураПараметров, ЭтаФорма);
	Исключение
		ОткрытьФорму("Обработка.rgsМониторСопровождения.Форма.ФормаПроверкиОрфографии", СтруктураПараметров, ЭтаФорма);
	КонецПопытки; 
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПравильноеХТМЛ(ТекстХТМЛ)
	
	ТекстНовогоСообщения.УстановитьHTML(ТекстХТМЛ, Новый Структура);
	
КонецПроцедуры

&НаКлиенте
Процедура ТекстВопроса(Команда)
	
	Элементы.Группа3.Видимость = Истина;
	Элементы.ГруппаПрисоединенныеФайлы.Видимость = Ложь;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРИСОЕДИНЕННЫЕ ФАЙЛЫ

&НаКлиенте
Процедура ПрисоединенныеФайлы(Команда)
	
	СтруктураДанных = Новый Структура("Пользователь, Пароль, АдресБазы, ГУИДВопроса", Объект.Пользователь, Объект.Пароль, Объект.АдресБазы, ГУИДВопроса);
	Попытка
		ОткрытьФорму("ВнешняяОбработка.rgsМониторСопровождения.Форма.ФормаПрикрепленныхФайлов", СтруктураДанных);
	Исключение
		ОткрытьФорму("Обработка.rgsМониторСопровождения.Форма.ФормаПрикрепленныхФайлов", СтруктураДанных);
	КонецПопытки; 
		
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаПрисоединенныеФайлыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Отказ = Истина;
    АдресВременногоХранилищаФайла = "";
	ИмяФайла = "";
	Результат = ПоместитьФайл(АдресВременногоХранилищаФайла, ИмяФайла, Истина, УникальныйИдентификатор);
	
	Если НЕ Результат Тогда
        Возврат;
    КонецЕсли; 
    Состояние("Загрузка файла на сервер..");
    
    ОписаниеФайла = ПолучитьОписаниеФайла(ИмяФайла);
	Если ПоместитьФайлыВПрисоединенные(ОписаниеФайла, АдресВременногоХранилищаФайла) Тогда
		ПоказатьОповещениеПользователя(,,  Символы.ПС + "Файл успешно добавлен");
        ОбновитьТаблицуФайлов();
    КонецЕсли;

КонецПроцедуры

&НаКлиенте
Функция ПолучитьОписаниеФайла(ИмяФайла)
	
	Структура = Новый Структура("Расширение, ИмяФайлаБезРасширения");
	
	СтрокиПути = РазложитьСтрокуПоТочкамИСлэшам(ИмяФайла);
	
	Если СтрокиПути.Количество() >= 2 Тогда
		Структура.Расширение = СтрокиПути[СтрокиПути.Количество()-1];
		Структура.ИмяФайлаБезРасширения = СтрокиПути[СтрокиПути.Количество()-2];
	Иначе
		ВызватьИсключение
			ПодставитьПараметрыВСтроку(
				ВернутьСтр("ru = 'Ошибка при помещении файла в хранилище: %1'"),ИмяФайла);
	КонецЕсли;
    	
	Возврат Структура;
	
КонецФункции

&НаКлиенте
// Функция раскладывает строку в массив строк, используя "./\" как разделитель
//
Функция РазложитьСтрокуПоТочкамИСлэшам(Знач Представление) Экспорт
	
	Перем ТекущаяПозиция;
	
	Фрагменты = Новый Массив;
	
	НачальнаяПозиция = 1;
	
	Для ТекущаяПозиция = 1 По СтрДлина(Представление) Цикл
		ТекущийСимвол = Сред(Представление, ТекущаяПозиция, 1);
		Если ТекущийСимвол = "." Или ТекущийСимвол = "/" Или ТекущийСимвол = "\" Тогда
			ТекущийФрагмент = Сред(Представление, НачальнаяПозиция, ТекущаяПозиция - НачальнаяПозиция);
			НачальнаяПозиция = ТекущаяПозиция + 1;
			Фрагменты.Добавить(ТекущийФрагмент);
		КонецЕсли;
	КонецЦикла;
	
	Если НачальнаяПозиция <> ТекущаяПозиция Тогда
		ТекущийФрагмент = Сред(Представление, НачальнаяПозиция, ТекущаяПозиция - НачальнаяПозиция);
		Фрагменты.Добавить(ТекущийФрагмент);
	КонецЕсли;
	
	Возврат Фрагменты;
	
КонецФункции

&НаСервере
Функция ПоместитьФайлыВПрисоединенные(ОписаниеФайла, АдресВременногоХранилищаФайла)

	ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресВременногоХранилищаФайла);
	Попытка
		Определение = Новый WSОпределения( Объект.АдресБазы+"/ws/MonitorExt.1cws?wsdl",  Объект.Пользователь,  Объект.Пароль);
		Прокси = ПолучитьПрокси(Определение);
		Прокси.Пользователь =  Объект.Пользователь;
		Прокси.Пароль = Объект.Пароль; 
		Результат = Прокси.ПоместитьФайлВПрисоединенные(ГУИДВопроса, ОписаниеФайла.ИмяФайлаБезРасширения, ДвоичныеДанные.Размер(), ОписаниеФайла.Расширение, ДвоичныеДанные);
	Исключение
		Сообщить(ОписаниеОшибки());
	КонецПопытки; 
	
	Если Результат <> "true" Тогда
		Если СтрНайти(Результат, "Файл с таким именем уже присутствует списке присоединенных файлов")<>0 Тогда
			Сообщить("Файл с таким именем уже присутствует списке присоединенных файлов!");
		Иначе 
			Сообщить(Результат);
		КонецЕсли; 
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли; 
	
КонецФункции
 
&НаКлиенте
Процедура СохранитьФайл(Команда)
	
	ТекСтрока = Элементы.ТаблицаПрисоединенныеФайлы.ТекущиеДанные;
	Если ТекСтрока = Неопределено  Тогда
		Возврат;
	КонецЕсли; 
	Состояние("Загрузка файла с сервера..");
	АдресВоВременномХранилище = ПолучитьДанныеФайлаССервера(ТекСтрока.ГУИДФайла);
	Состояние("Загрузка файла завершена");
	Результат = ПолучитьФайл(АдресВоВременномХранилище,ТекСтрока.Наименование + "."+ТекСтрока.Расширение,Истина);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьДанныеФайлаССервера(ГУИДФайла)
	
	Попытка
		Определение = Новый WSОпределения( Объект.АдресБазы+"/ws/MonitorExt.1cws?wsdl",  Объект.Пользователь,  Объект.Пароль);
		Прокси = ПолучитьПрокси(Определение);
		Прокси.Пользователь =  Объект.Пользователь;
		Прокси.Пароль = Объект.Пароль; 
		ПолученныйФайл = ЗначениеИзСтрокиВнутр(Прокси.ПолучитьПрисоединенныйФайл(ГУИДФайла));
		Возврат ПоместитьВоВременноеХранилище(ПолученныйФайл);
	Исключение
		Сообщить(ОписаниеОшибки());
		Возврат Неопределено;
	КонецПопытки; 
 
КонецФункции
 
&НаКлиенте
Процедура ТаблицаПрисоединенныеФайлыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекСтрока = Элемент.ТекущиеДанные;
	Если СтрЗаменить(Элемент.ТекущийЭлемент.Имя,"ПрисоединенныеФайлы","")="Описание" Тогда
		Возврат;
	КонецЕсли; 
	Состояние("Загрузка файла с сервера..");
	АдресВоВременномХранилище = ПолучитьДанныеФайлаССервера(ТекСтрока.ГУИДФайла);
	Состояние("Загрузка файла завершена");
	Результат = ПолучитьФайл(АдресВоВременномХранилище,ТекСтрока.Наименование + "."+ТекСтрока.Расширение,Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаПрисоединенныеФайлыПередУдалением(Элемент, Отказ)
	
	Отказ = Истина;
	ТекСтрока = Элементы.ТаблицаПрисоединенныеФайлы.ТекущиеДанные;
	Если ТекСтрока = Неопределено Тогда
		ТекстПредупреждения = "Активизируйте строку с файлом";
		Структура = Новый Структура;
		Структура.Вставить("ТекстПредупреждения",ТекстПредупреждения);
		Попытка
			ОткрытьФорму("ВнешняяОбработка.rgsМониторСопровождения.Форма.ФормаПредупреждения", Структура, ЭтаФорма);
		Исключение
			ОткрытьФорму("Обработка.rgsМониторСопровождения.Форма.ФормаПредупреждения", Структура, ЭтаФорма);
		КонецПопытки; 
		Возврат;
	КонецЕсли;
	Если ТекСтрока.ФайлРедактируется И Не ТекСтрока.ФайлРедактируетТекущийПользователь Тогда
		ТекстПредупреждения = "В настоящий момент данный файл редактируется пользователем 
						| и не может быть помечен на удаление.";
		Структура = Новый Структура;
		Структура.Вставить("ТекстПредупреждения",ТекстПредупреждения);
		Попытка
			ОткрытьФорму("ВнешняяОбработка.rgsМониторСопровождения.Форма.ФормаПредупреждения", Структура, ЭтаФорма);
		Исключение
			ОткрытьФорму("Обработка.rgsМониторСопровождения.Форма.ФормаПредупреждения", Структура, ЭтаФорма);
		КонецПопытки; 
		Возврат;
	КонецЕсли; 
	
	Если ТекСтрока.ПометкаУдаленияФайла Тогда
		ТекстВопроса = "Снять пометку удаления с """ + ТекСтрока.Наименование + """?";
	Иначе
		ТекстВопроса = "Установить пометку удаления на """ + ТекСтрока.Наименование + """?";
	КонецЕсли;
	Структура = Новый Структура;
	Структура.Вставить("ТекстВопроса", ТекстВопроса);
	Структура.Вставить("РежимВопроса","ДаНет");
	Структура.Вставить("ГУИДФайла", ТекСтрока.ГУИДФайла);
	Структура.Вставить("ПометкаУдаления", Не ТекСтрока.ПометкаУдаленияФайла);
	Структура.Вставить("ИмяСобытия","ПометкаУдаленияНаФайл");
	
	Попытка
		ОткрытьФорму("ВнешняяОбработка.rgsМониторСопровождения.Форма.ФормаВопроса", Структура, ЭтаФорма);
	Исключение
		ОткрытьФорму("Обработка.rgsМониторСопровождения.Форма.ФормаВопроса", Структура, ЭтаФорма);
	КонецПопытки; 

КонецПроцедуры
 
&НаСервере
Процедура УстановитьПометкуУдаленияСервер(ГУИДФайла, ПометкаУдаления)
	
	Попытка
		Определение = Новый WSОпределения( Объект.АдресБазы+"/ws/MonitorExt.1cws?wsdl",  Объект.Пользователь,  Объект.Пароль);
		Прокси = ПолучитьПрокси(Определение);
		Прокси.Пользователь =  Объект.Пользователь;
		Прокси.Пароль 		= Объект.Пароль; 
		Прокси.УстановитьПометкуУдаленияФайла(ГУИДФайла, ПометкаУдаления);
	Исключение
		Сообщить(ОписаниеОшибки());
	КонецПопытки; 
	
КонецПроцедуры
 
&НаКлиенте
Процедура ЗаменитьИзФайлаНаДиске(Команда)

	ТекСтрока = Элементы.ТаблицаПрисоединенныеФайлы.ТекущиеДанные;
	Если ТекСтрока = Неопределено Тогда
		ТекстПредупреждения = "Активизируйте строку с файлом";
		Структура = Новый Структура;
		Структура.Вставить("ТекстПредупреждения",ТекстПредупреждения);
		Попытка
			ОткрытьФорму("ВнешняяОбработка.rgsМониторСопровождения.Форма.ФормаПредупреждения", Структура, ЭтаФорма);
		Исключение
			ОткрытьФорму("Обработка.rgsМониторСопровождения.Форма.ФормаПредупреждения", Структура, ЭтаФорма);
		КонецПопытки; 
		Возврат;
	КонецЕсли;
	Если ТекСтрока.ФайлРедактируется И Не ТекСтрока.ФайлРедактируетТекущийПользователь Тогда
		ТекстПредупреждения = "В настоящий момент данный файл редактируется пользователем 
		| и не может быть изменен";
		Структура = Новый Структура;
		Структура.Вставить("ТекстПредупреждения",ТекстПредупреждения);
		Попытка
			ОткрытьФорму("ВнешняяОбработка.rgsМониторСопровождения.Форма.ФормаПредупреждения", Структура, ЭтаФорма);
		Исключение
			ОткрытьФорму("Обработка.rgsМониторСопровождения.Форма.ФормаПредупреждения", Структура, ЭтаФорма);
		КонецПопытки; 
		Возврат;
	КонецЕсли;
	
	Структура = Новый Структура;
	Структура.Вставить("ТекстВопроса", "Заменить присоединенный файл?");
	Структура.Вставить("РежимВопроса","ДаНет");
	Структура.Вставить("ГУИДФайла", ТекСтрока.ГУИДФайла);
	Структура.Вставить("ИмяСобытия","ЗаменитьПрисоединенныйФайл");
	
	Попытка
		ОткрытьФорму("ВнешняяОбработка.rgsМониторСопровождения.Форма.ФормаВопроса", Структура, ЭтаФорма);
	Исключение
		ОткрытьФорму("Обработка.rgsМониторСопровождения.Форма.ФормаВопроса", Структура, ЭтаФорма);
	КонецПопытки; 
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьФайлНаСервере(ГУИДФайла, ИмяФайла, АдресВременногоХранилищаФайла)
	
	Файл = Новый Файл(ИмяФайла);
	Размер = Файл.Размер();
	Расширение = Файл.Расширение;
	ИмяФайлаБезРасширения = Файл.ИмяБезРасширения;
	ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресВременногоХранилищаФайла);
	Попытка
		Определение = Новый WSОпределения( Объект.АдресБазы+"/ws/MonitorExt.1cws?wsdl",  Объект.Пользователь,  Объект.Пароль);
		Прокси = ПолучитьПрокси(Определение);
		Прокси.Пользователь =  Объект.Пользователь;
		Прокси.Пароль = Объект.Пароль; 
		Результат = Прокси.ЗаменитьФайлВПрисоединенных(ГУИДФайла, ИмяФайлаБезРасширения, Размер, Расширение, ДвоичныеДанные);
	Исключение
		Сообщить(ОписаниеОшибки());
	КонецПопытки; 
	
	Если Результат <> "true" Тогда
		Сообщить(Результат);
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПрисоединенныеФайлыОписаниеОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка)
		
	ТекСтрока = Элементы.ТаблицаПрисоединенныеФайлы.ТекущиеДанные;
	Если ТекСтрока.ФайлРедактируется И Не ТекСтрока.ФайлРедактируетТекущийПользователь Тогда
		ОбновитьТаблицуФайлов();
        ТекстПредупреждения = "В настоящий момент данный файл редактируется пользователем " + Символы.ПС + ТекСтрока.Редактирует +
						" и не может быть изменен";
		Структура = Новый Структура;
		Структура.Вставить("ТекстПредупреждения",ТекстПредупреждения );
		Попытка
			ОткрытьФорму("ВнешняяОбработка.rgsМониторСопровождения.Форма.ФормаПредупреждения", Структура, ЭтаФорма);
		Исключение
			ОткрытьФорму("Обработка.rgsМониторСопровождения.Форма.ФормаПредупреждения", Структура, ЭтаФорма);
		КонецПопытки; 
		Возврат;
	КонецЕсли;
	УстановитьОписаниеФайла(ТекСтрока.ГУИДФайла, Текст);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОписаниеФайла(ГУИДФайла, ТекстОписания)
	
	Попытка
		Определение = Новый WSОпределения( Объект.АдресБазы+"/ws/MonitorExt.1cws?wsdl",  Объект.Пользователь,  Объект.Пароль);
		Прокси = ПолучитьПрокси(Определение);
		Прокси.Пользователь =  Объект.Пользователь;
		Прокси.Пароль = Объект.Пароль; 
		Результат = Прокси.УстановитьТекстОписанияФайла(ГУИДФайла, ТекстОписания);
	Исключение
		Сообщить(ОписаниеОшибки());
	КонецПопытки; 
  	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьСоставОбсуждающих(Команда)
	
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("ГУИДПроекта", ГУИДПроекта);
	СтруктураДанных.Вставить("Объект", Объект);
	СтруктураДанных.Вставить("ГУИДВопроса", ГУИДВопроса);
	СтруктураДанных.Вставить("ИмяСобытия", "ОбсуждающиеИзменение");

	Попытка
		ОткрытьФорму("ВнешняяОбработка.rgsМониторСопровождения.Форма.ФормаОбсуждающиеИзменение", СтруктураДанных, ЭтаФорма);
	Исключение
	    ОткрытьФорму("Обработка.rgsМониторСопровождения.Форма.ФормаОбсуждающиеИзменение", СтруктураДанных, ЭтаФорма);
	КонецПопытки; 

КонецПроцедуры

&НаКлиенте
Процедура РазвернутьСвернутьНовоеСообщение(Команда)
	
	Если Элементы.РазвернутьСвернутьНовоеСообщение.Заголовок = "Развернуть новое сообщение" Тогда
		Элементы.ИсторияОбсуждения.Видимость = Ложь;
		Элементы.РазвернутьСвернутьНовоеСообщение.Заголовок = "Свернуть новое сообщение";
		ЭтаФорма.Высота=0;
	Иначе
		Элементы.ИсторияОбсуждения.Видимость = Истина;
	   	Элементы.РазвернутьСвернутьНовоеСообщение.Заголовок = "Развернуть новое сообщение"; 
		ЭтаФорма.Высота=0;
	КонецЕсли; 
	
КонецПроцедуры
 
&НаКлиенте
Процедура РазвернутьСвернутьФорум(Команда)
	
	Если Элементы.РазвернутьСвернутьФорум.Заголовок = "Развернуть историю вопроса" Тогда
		Элементы.ГруппаНовогоСообщения.Видимость = Ложь;
		Элементы.Группа2.Видимость = Ложь;
		Элементы.РазвернутьСвернутьФорум.Заголовок = "Свернуть историю вопроса";
		ЭтаФорма.Высота=0;
	Иначе
		Элементы.ГруппаНовогоСообщения.Видимость = Истина;
		Элементы.Группа2.Видимость = Истина;
		Элементы.РазвернутьСвернутьФорум.Заголовок = "Развернуть историю вопроса";
		ЭтаФорма.Высота=0;
   	КонецЕсли; 
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПрокси(Определение)
	
	Возврат Новый WSПрокси (Определение, "RemoteConnect", "RemoteConnect", "RemoteConnectSoap");
	
КонецФункции

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	
	Если НеПрочитан Тогда
		СписокВопросов = Новый Массив;
		СписокВопросов.Добавить(ГУИДВопроса);
		СделатьНеПрочитаннымСервер(СписокВопросов, Объект.АдресБазы, Объект.Пользователь, Объект.Пароль, НеПрочитан);
		Оповестить("НужноОбновитьСписокВопросов", , ЭтаФорма);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция СделатьНеПрочитаннымСервер(СписокВопросов, АдресБазы, Пользователь, Пароль, ПризнакНепрочитанного)
	
	Попытка
		Определение = Новый WSОпределения(АдресБазы+"/ws/MonitorExt.1cws?wsdl",  Пользователь,  Пароль);
		Прокси = ПолучитьПрокси(Определение);
		Прокси.Пользователь =  Пользователь;
		Прокси.Пароль = Пароль; 
		Возврат Прокси.УстановитьПризнакНепрочитанного(ПризнакНепрочитанного, ЗначениеВСтрокуВнутр(СписокВопросов));
	Исключение
		Возврат ОписаниеОшибки();
	КонецПопытки; 
		
КонецФункции	


&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ЗавершениеВопросаИзДобавленияСообщения" Тогда
		Результат = ЗавершитьОбсуждениеВопросаСервер(Параметр.ГУИДВопроса);
		Если ТипЗнч(Результат) <> Тип("Булево") Тогда
			Структура = Новый Структура;
			Структура.Вставить("ТекстПредупреждения",Результат);
			Попытка
				ОткрытьФорму("ВнешняяОбработка.rgsМониторСопровождения.Форма.ФормаПредупреждения", Структура, ЭтаФорма);
			Исключение
				ОткрытьФорму("Обработка.rgsМониторСопровождения.Форма.ФормаПредупреждения", Структура, ЭтаФорма);
			КонецПопытки; 
			Возврат;
		Иначе
			ПоказатьОповещениеПользователя(,,  Символы.ПС + "Вопрос " + Элементы.ТаблицаВопросов.ТекущиеДанные.Ссылка + " закрыт", );
			Оповестить("НужноОбновитьСписокВопросов", , ЭтаФорма);
			ЭтаФорма.Закрыть();
		КонецЕсли; 
	ИначеЕсли ИмяСобытия = "ЗаменитьПрисоединенныйФайл" Тогда
		АдресВременногоХранилищаФайла = "";
		ИмяФайла = "";
		Результат = ПоместитьФайл(АдресВременногоХранилищаФайла, ИмяФайла, ИмяФайла, Истина, УникальныйИдентификатор);
		Если НЕ Результат Тогда
			Возврат;
		КонецЕсли; 
		ОбновитьФайлНаСервере(Параметр.ГУИДФайла, ИмяФайла, АдресВременногоХранилищаФайла);
		ОбновитьТаблицуФайлов();
	ИначеЕсли ИмяСобытия = "ОбсуждающиеИзменение" Тогда
		Если Параметр<>Неопределено Тогда
			ПоказатьОповещениеПользователя(,,  Символы.ПС + Параметр);
			ЗаполнитьСпискиУчастниковВопроса();
		КонецЕсли;
	ИначеЕсли ИмяСобытия = "ПроверкаОрфографииФормаДобавленияСообщения" Тогда
		Если Параметр <> Неопределено Тогда
			УстановитьПравильноеХТМЛ(Параметр);
		КонецЕсли;
	ИначеЕсли ИмяСобытия = "ПометкаУдаленияНаФайл" Тогда
		УстановитьПометкуУдаленияСервер(Параметр.ГУИДФайла, Не Параметр.ПометкаУдаленияФайла);
		ОбновитьТаблицуФайлов();
		
	КонецЕсли; 
	
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ЗакрыватьПриЗакрытииВладельца = Истина;
	
КонецПроцедуры
